import React, { useEffect, useState } from "react";
import { io } from "socket.io-client";

const socket = io(""); // keep as-is if same origin
// const socket = io("http://35.207.197.197/"); // keep as-is if same origin

const QrPage = () => {
  const [qrImage, setQrImage] = useState("");
  const [status, setStatus] = useState("Waiting for QR...");
  const [connected, setConnected] = useState(false);
  console.log("connected===========>", connected);
  const [loading, setLoading] = useState(false);

  useEffect(() => {
    socket.on("qr", (qr) => {
      setQrImage(qr);
      setStatus("Scan this QR using WhatsApp");
    });

    socket.on("message", (msg) => {
      setStatus(msg);
    });

    socket.on("ready", () => {
      setStatus("Connected 🎉");
      setConnected(true);
    });

    return () => {
      socket.off("qr");
      socket.off("message");
      socket.off("ready");
    };
  }, []);

  const handleSendMessage = async () => {
    try {
      setLoading(true);
      setStatus("Sending message...");

      const res = await fetch(
        "http://35.207.197.197/master/sendParallelMessage",
        {
          method: "POST",
          headers: {
            "Content-Type": "application/json",
          },
          body: JSON.stringify({
            groups: [],
            message: {
              messageMediaUrl: "",
              templateName: "readingMsg_YT",
              templateId: "020226",
              messageType: "text",
              messageText: [
                "ପ୍ରିୟ ଅଭିଭାବକ,\n\nମୁଁ ଆଶା କରୁଛି 'ପଢ଼ିବା, ଗଢ଼ିବା ଓଡ଼ିଶା' ଅଭିଯାନରେ ଆସୁଥିବା କାହାଣୀ ଭିଡିଓଗୁଡ଼ିକ ଆପଣ ସ୍କୁଲ ହ୍ୱାଟ୍ସଆପ୍ ଗ୍ରୁପ୍ ରେ ପାଉଥିବେ । ଏହି କାହାଣୀ ଭିଡିଓ ପିଲା ସହ ବସି ଦେଖନ୍ତୁ ଏବଂ ପିଲାକୁ ପଢ଼ିବା ପାଇଁ ଉତ୍ସାହିତ କରନ୍ତୁ । ଏହା ସହ ଭିଡିଓ ଶେଷରେ ଥିବା ପ୍ରଶ୍ନଗୁଡ଼ିକର ଉତ୍ତର ପିଲାଙ୍କୁ ପଚାରନ୍ତୁ । ପିଲା ଦେଉଥିବା କିମ୍ବା ଲେଖୁଥିବା ଉତ୍ତର ହ୍ୱାଟ୍ସଆପ୍ ଗ୍ରୁପ୍ ରେ ନିଶ୍ଚୟ ପଠାଇବେ ।\n\nଆପଣଙ୍କ,\nବୀଣା ଦିଦି",
                "ପଢ଼ିବା, ଗଢ଼ିବା ଓଡ଼ିଶା\n\nପ୍ରିୟ ଅଭିଭାବକ, ମୁଁ ବୀଣା ଦିଦି । ପଠନ ଅଭିଯାନର ନୂଆ କାହାଣୀ ଆପଣଙ୍କ ପାଇଁ ନେଇ ଆସିଛି । ଏହି କାହାଣୀ ଦେଖି ଓ ଶୁଣି ପିଲାମାନେ  ବାକ୍ୟ ପଢ଼ି ପାରିବା ଓ ଲେଖିବାରେ ଆଗ୍ରହୀ ହେବେ । ଏହି ଭିଡ଼ିଓ ଦେଖିବା ପରେ ଆପଣ ସେମାନଙ୍କୁ କିଛି ସହଜ ପ୍ରଶ୍ନ ପଚାରି, ଆଲୋଚନା କରିପାରିବେ । \n\nସ୍ତର ୩ -  https://youtu.be/4dOXs-1NXVw \nଏହିପରି କାହାଣୀଗୁଡ଼ିକ ଆପଣ ହ୍ୱାଟ୍ସଆପ୍ ଚ୍ୟାନେଲ୍ ଓ ୟୁଟ୍ୟୁବ୍ ଚ୍ୟାନେଲ୍ ସବସ୍କ୍ରାଇବ କରି ପାଇ ପାରିବେ ।",
                "ପଢ଼ିବା, ଗଢ଼ିବା ଓଡ଼ିଶା\n\nପ୍ରଣାମ, ମୁଁ ବୀଣା ଦିଦି । ଆପଣଙ୍କ ପିଲା ପାଇଁ ଆଜି ମୁଁ ପଠନ ଅଭିଯାନର ସ୍ତର-୩ ର ଏକ ଆନନ୍ଦମୟ କାହାଣୀ ନେଇ ଆସିଛି । ଏହି ଭିଡିଓଟି ଦେଖାଇ,ପିଲାଙ୍କୁ କାହାଣୀ ଶୁଣିବା ସହ ବାକ୍ୟ ପଢ଼ି ପାରିବା ପାଇଁ  ଉତ୍ସାହିତ କରନ୍ତୁ । ଭିଡିଓ ଶେଷରେ ପିଲାଙ୍କ ସହ ଆଲୋଚନା କରନ୍ତୁ ଓ କିଛି ପ୍ରଶ୍ନ ପଚାରନ୍ତୁ । ଏହିପରି କାହାଣୀ ଭିଡିଓଗୁଡ଼ିକ ହ୍ୱାଟ୍ସଆପ୍, ଚ୍ୟାନେଲ୍ ଓ ୟୁଟ୍ୟୁବ୍ ରେ ପାଇପାରିବେ । ଏହାସହ କାହାଣୀଟି କିପରି ଲାଗିଲା ଆପଣଙ୍କ ମତାମତ ଜଣାଇବାକୁ ଭୁଲିବେ ନାହିଁ ।\n\n\nସ୍ତର ୩ -  https://youtu.be/4dOXs-1NXVw ",
                "ପଢ଼ିବା, ଗଢ଼ିବା ଓଡ଼ିଶା\n\nମୁଁ ଆପଣମାନଙ୍କ ପ୍ରିୟର ବୀଣା ଦିଦି । ଆଜି ପଠନ ଅଭିଯାନର ସୁନ୍ଦର କାହାଣୀଗୁଡ଼ିକ ଆଣିଛି । ଆପଣ ପିଲାମାନଙ୍କୁ ଭିଡିଓଟି ଦେଖାଇ, ସେମାନଙ୍କୁ  ବାକ୍ୟ ପଢ଼ିବା ଓ ଲେଖିବାରେ ମଜା କରିବା ପାଇଁ ପ୍ରୋତ୍ସାହନ କରନ୍ତୁ । ପିଲାଙ୍କୁ କାହାଣୀ ବିଷୟରେ କିଛି ପ୍ରଶ୍ନ ମଧ୍ୟ ପଚାରନ୍ତୁ । ଏହି ଭିଡିଓଗୁଡ଼ିକ ହ୍ୱାଟ୍ସଆପ୍ ଗ୍ରୁପ୍, ଚ୍ୟାନେଲ୍ ଓ ୟୁଟ୍ୟୁବ୍ ରେ ଉପଲବ୍ଧ ଅଛି ।ଏହାସହ କାହାଣୀଟି କିପରି ଲାଗିଲା ଆପଣଙ୍କ ମତାମତ ମୋତେ ଜଣାଇବେ ।\n\nସ୍ତର ୩ -  https://youtu.be/4dOXs-1NXVw ",
                "ପଢ଼ିବା, ଗଢ଼ିବା ଓଡ଼ିଶା\n\nନମସ୍କାର ! ମୁଁ ପିଲାମାନଙ୍କ ପ୍ରିୟର ବୀଣା ଦିଦି । ଆପଣଙ୍କ ପିଲା ପାଇଁ ପଠନ ଅଭିଯାନର ନୂତନ କାହାଣୀଗୁଡ଼ିକ ନେଇ ଆସିଛି । ଏହି କାହାଣୀ ଭିଡିଓଟି ପିଲାମାନଙ୍କୁ ଦେଖାଇ, ବାକ୍ୟ ପଢ଼ିବା, ଲେଖିବା ଓ କାହାଣୀ ବୁଝିବା ପାଇଁ ପ୍ରେରିତ କରନ୍ତୁ । ଭିଡିଓ ଦେଖି ସେମାନେ ଆନନ୍ଦ ସହ ଶିଖିବେ । ଏହିପରି ଭିଡିଓଗୁଡ଼ିକ ୟୁଟ୍ୟୁବ୍, ହ୍ୱାଟ୍ସଆପ୍ ଗ୍ରୁପ୍ ଓ ଚ୍ୟାନେଲ୍ ରେ ମିଳିବ । କାହାଣୀଟି କିପରି ଲାଗିଲା ମୋତେ ନିଶ୍ଚୟ ଜଣାଇବେ । \n\n\nସ୍ତର ୩ -  https://youtu.be/4dOXs-1NXVw \n\nକାହାଣୀ କିପରି ଲାଗିଲା ମୋତେ ନିଶ୍ଚୟ ଜଣାଇବେ । ",
                "ପଢ଼ିବା, ଗଢ଼ିବା ଓଡ଼ିଶା\n\nଆଜି ମୁଁ, ବୀଣାଦିଦି ଆପଣଙ୍କ ପାଇଁ ପଠନ ଅଭିଯାନର ଆଉ ଏକ ଭିଡିଓ ନେଇ ଆସିଛି । ଆପଣଙ୍କୁ ଅନୁରୋଧ, ପିଲାଙ୍କୁ ଏହି କାହାଣୀ ଦେଖାଇ, ସେମାନଙ୍କୁ କାହାଣୀ ଶୁଣିବା, ବୁଝିବା ଏବଂ ପଢ଼ିବା ପାଇଁ ଉତ୍ସାହିତ କରନ୍ତୁ। କାହାଣୀ ପରେ ପିଲାଙ୍କୁ ନିଜ ମନରୁ କିଛି ପ୍ରଶ୍ନ ପଚାରନ୍ତୁ, ଯାହାଦ୍ଵାରା ପିଲାମାନେ କାହାଣୀଟିକୁ ଭଲ ଭାବରେ ଚିନ୍ତା କରିବେ ଏବଂ ମନେରଖିବେ । ଏହିପରି ଭିଡିଓଗୁଡ଼ିକ ୟୁଟ୍ୟୁବ୍, ହ୍ୱାଟ୍ସଆପ୍ ଗ୍ରୁପ୍ ଓ ଚ୍ୟାନେଲ୍ ରେ ମିଳିବ । କାହାଣୀଟି ପିଲାମାନଙ୍କୁ କେମିତି ଲାଗିଲା ମୋତେ ଜଣାଇବେ । \n\nସ୍ତର ୩ -  https://youtu.be/4dOXs-1NXVw \n\n",
              ],
            },
          }),
        },
      );

      const data = await res.json();
      setStatus("Message sent successfully ✅");
    } catch (err) {
      setStatus("Failed to send message ❌");
    } finally {
      setLoading(false);
    }
  };

  const handleSyncServer = async () => {
    try {
      setLoading(true);
      setStatus("Syncing server...");

      const res = await fetch("http://35.207.197.197/master/syncServers", {
        method: "GET",
        headers: {
          "Content-Type": "application/json",
        },
      });

      const data = await res.json();
      setStatus("Server synced successfully ✅");
    } catch (err) {
      setStatus("Server sync failed ❌");
    } finally {
      setLoading(false);
    }
  };

  return (
    <div style={styles.container}>
      <h2>Scan WhatsApp QR Code</h2>
      <p>{status}</p>

      {qrImage && !connected && (
        <img src={qrImage} alt="WhatsApp QR" width="300" style={styles.image} />
      )}
      {connected && (
        <button
          onClick={handleSyncServer}
          disabled={loading}
          style={styles.button}
        >
          {loading ? "Syncing..." : "Sync Server"}
        </button>
      )}

      {connected && (
        <button
          onClick={handleSendMessage}
          disabled={loading}
          style={styles.button}
        >
          {loading ? "Sending..." : "Send Message"}
        </button>
      )}
    </div>
  );
};

const styles = {
  container: {
    fontFamily: "Arial",
    textAlign: "center",
    marginTop: "40px",
  },
  image: {
    marginTop: "20px",
    border: "2px solid #222",
    borderRadius: "10px",
  },
  button: {
    marginTop: "20px",
    padding: "12px 24px",
    fontSize: "16px",
    cursor: "pointer",
    backgroundColor: "#25D366",
    color: "#fff",
    border: "none",
    borderRadius: "6px",
  },
};

export default QrPage;
